app/Http/Controllers/TaskController.php

select count(*) as aggregate from "tasks"
---
    public function index(Request $request){
        $perPage = $request->input('per_page', 15);
        $page = $request->input('page', 1);

        $tasks = Task::with(['user'])->paginate($perPage, ['*'], 'page', $page);