app/Http/Controllers/UserController.php

select * from "users" where "users"."deleted_at" is null limit 15 offset 0
select count(*) as aggregate from "users" where "users"."deleted_at" is null
---
    public function index(Request $request)
    {
        $perPage = $request->input('per_page', 15);
        $page = $request->input('page', 1);

        // Get users directly without caching paginator objects
        $users = User::with('department')->paginate($perPage, ['*'], 'page', $page);

insert into "users" ("fullname", "email", "password", "role", "job_title", "image", "username", "salary", "updated_at", "created_at") values ('saeb', 'saeb@gmail.com', '$2y$12$hS8nwUPExP8loAlowg1c1.wLvvda9PCuvh3cqSWXkTXxj7Rgj7i1q', 'EMPLOYEE', 'IT support', 'users/1779099555.png', 'saeb1994', '2500', '2026-05-18 10:19:15', '2026-05-18 10:19:15')
---
    public function store(Request $request)
    {
        $validated = $request->validate([
            'fullname' => 'required|string',
            'email' => 'required|email|unique:users,email',
            'password' => 'required|string|min:6',
            'role' => 'required|in:ADMIN,HR_MANAGER,EMPLOYEE',
            'department_id' => 'nullable|exists:departments,id',
            'job_title' => 'required|string',
            'image' => 'file|mimes:jpeg,jpg,png,gif,webp|extensions:jpeg,jpg,png,gif,webp|mimetypes:image/jpeg,image/png,image/gif,image/webp|max:2048',
            'username' => 'required|unique:users,username',
            'salary' => 'required|integer',
        ]);

        if ($request->hasFile('image')) {
            $userDir = public_path('images/users');
            if (! is_dir($userDir)) {
                mkdir($userDir, 0755, true);
            }

            $extension = $request->image->guessExtension() ?? $request->image->getClientOriginalExtension();
            $imageName = time().'_'.uniqid().'.'.strtolower($extension);
            $request->image->move($userDir, $imageName);
            $validated['image'] = 'users/'.$imageName;
        }
        // Hash::make

        $user = User::create($validated);

select * from "users" where "users"."id" = '3' and "users"."deleted_at" is null limit 1
---
    public function show($id)
    {
        $user = User::with('department')->findOrFail($id);